# Создайте словарь, где ключи — это названия городов,
# а значения — кортежи с координатами (широта, долгота). Выведите координаты для одного из городов.

city_coordinates = {
    "New York" (40.7128,


print(city_coordinates[