# Вывести все числа от 1 до 50, которые делятся на 3.
for i in range(1, 51):
    if i % 3 == 0:
        print(i)

