# Создайте список из трех кортежей с координатами точек (x, y). Выведите все точки на экран.

points = [(1, 2), (3, 4), (5, 6)]

for point in points:
    print(point)

