# Создайте два кортежа: tuple1 с элементами (1, 2, 3) и tuple2 с элементами (4, 5, 6).
# Объедините их в один кортеж и выведите результат.


tuple1 = (1, 2, 3)
tuple2 = (4, 5, 6)
combined = tuple1 + tuple2
print(combined)