# Создайте словарь, где ключи — это названия городов,
# а значения — кортежи с координатами (широта, долгота). Выведите координаты для одного из городов.

city_coordinates = {
    "New York": (40.7128, -74.0060),
    "Los Angeles": (34.0522, -118.2437),
    "Chicago": (41.8781, -87.6298),
}

print(city_coordinates["Chicago"])